project-teller/obc/src/hal/stm32/spi.cpp
#include "config.h"
#include "stm32_hal.h"
#include <cmsis_os2.h>

#include <limits>

#include "hal/mutex.hpp"
#include "hal/spi.h"
#include "hal/stm32/utils.h"
#include "hal/system.h"

using namespace teller::hal::utils;

#define SPI_TIMEOUT_MSEC 100

static const uint32_t EVT_DONE = 0x00000001U;
static const uint32_t EVT_ERROR = 0x00000002U;

#define NUM_GPIO_PINS_PER_BUS 3
#define NUM_CS_PINS_PER_BUS 6

typedef struct {
    SPI_TypeDef* instance;
    union {
        gpio_port_and_pins_t by_index[NUM_GPIO_PINS_PER_BUS];
        struct {
            gpio_port_and_pins_t clk;
            gpio_port_and_pins_t miso;
            gpio_port_and_pins_t mosi;
        } by_name;
    } gpio;
    gpio_port_and_pins_t cs[NUM_CS_PINS_PER_BUS];
    uint8_t mode;
    IRQn_Type irq;
    bool use_irq;
    uint32_t clock_speed;
} spi_bus_config_t;

typedef struct {
    SPI_HandleTypeDef handle;
    const spi_bus_config_t* cfg;
    osEventFlagsId_t event;
    bool initialized;
    teller::hal::mutex in_use;
} spi_bus_state_t;

#define NO_MORE_SPI_BUSES \
    {                     \
        0                 \
    }

#define NO_MORE_GPIO_CFG \
    {                    \
        0                \
    }

/* clang-format off */
#if defined(TELLER_BOARD_NUCLEO144)
// STM32H743ZI Nucleo-144 dev board, for testing purposes
#define NUM_SPI_BUSES 2
const spi_bus_config_t spi_config[] = {
    {
        .instance = SPI1,
        .gpio = {
            .by_name = {
                .clk = { GPIOA, GPIO_PIN_5 },
                .miso = { GPIOA, GPIO_PIN_6 },
                .mosi = { GPIOB, GPIO_PIN_5 }
            }
        },
        .cs = {
            // Device 0
            { GPIOD, GPIO_PIN_14 },
            NO_MORE_GPIO_CFG
        },
        .mode = 0,
        .irq = SPI1_IRQn,
        .use_irq = true,
        .clock_speed = 0,
    },
    NO_MORE_SPI_BUSES
};
#elif defined(TELLER_BOARD_STM32F4)
// STM32F415RG TELLER OBC board
#define NUM_SPI_BUSES 3
const spi_bus_config_t spi_config[] = {
    {
        .instance = SPI1,
        .gpio = {
            .by_name = {
                .clk = { GPIOB, GPIO_PIN_3 },
                .miso = { GPIOB, GPIO_PIN_4 },
                .mosi = { GPIOB, GPIO_PIN_5 }
            }
        },
        .cs = {
            // Device 0
            { GPIOA, GPIO_PIN_15 },
            NO_MORE_GPIO_CFG
        },
        .mode = 0,
        .irq = SPI1_IRQn,
        .use_irq = false,
        .clock_speed = 1000000,
    },
    {
        .instance = SPI2,
        .gpio = {
            .by_name = {
                .clk = { GPIOB, GPIO_PIN_10 },
                .miso = { GPIOC, GPIO_PIN_2 },
                .mosi = { GPIOC, GPIO_PIN_3 }
            }
        },
        .cs = {
            // Device 0
            { GPIOB, GPIO_PIN_9 },
            NO_MORE_GPIO_CFG
        },
        .mode = 0,
        .irq = SPI2_IRQn,
        .use_irq = false,
        /* SPI2 bus holds the SD card reader and it will manage its own clock speed */
        .clock_speed = 0,
    },
    {
        .instance = SPI3,
        .gpio = {
            .by_name = {
                .clk = { GPIOC, GPIO_PIN_10 },
                .miso = { GPIOC, GPIO_PIN_11 },
                .mosi = { GPIOC, GPIO_PIN_12 }
            }
        },
        .cs = {
            { GPIOB, GPIO_PIN_15 },
            { GPIOB, GPIO_PIN_14 },
            { GPIOB, GPIO_PIN_13 },
            { GPIOB, GPIO_PIN_12 },
            { GPIOA, GPIO_PIN_4 },
            NO_MORE_GPIO_CFG
        },
        /* The datasheet of the MLX90393 magnetometer explicitly claims that
         * SPI mode 3 is implemented, but mode 0 also seems to work.
         *
         * The datasheet of the MAX11643 ADC explicitly claims that SPI mode
         * 0 and 3 are both supported.
         */
        .mode = 0,
        .irq = SPI3_IRQn,
        .use_irq = false,
        /* IMU on SPI3 is somewhat slow so stick to lower clock speeds */
        .clock_speed = 0,
    },
    NO_MORE_SPI_BUSES
};
#elif defined STM32F4
// STM32F4-Discovery
#define NUM_SPI_BUSES 0
const spi_bus_config_t spi_config[] = {
    NO_MORE_SPI_BUSES
};
#else
// No SPI buses supported on this hardware
#define NUM_SPI_BUSES 0
const spi_bus_config_t spi_config[] = {
    NO_MORE_SPI_BUSES
};
#endif
/* clang-format on */

static bool configure_spi_bus(std::uint8_t bus, spi_bus_state_t* state, const spi_bus_config_t* cfg);
static spi_bus_state_t* find_spi_bus_state(SPI_HandleTypeDef* hspi);
static bool is_spi_address_valid(teller::hal::spi::address_t address);
static bool is_spi_bus_index_valid(std::uint8_t bus);

static uint32_t getPeripheralClockFreqForBus(std::uint8_t bus);

static SPI_HandleTypeDef* spi_handle_ptrs[7];
static spi_bus_state_t spi_state[NUM_SPI_BUSES];

static HAL_StatusTypeDef last_hal_status;

namespace teller::hal::spi {

const address_t NO_ADDRESS = { 0xFF, 0xFF };
const transfer_t NO_MORE_TRANSFERS = { 0, 0, 0 };

bool init()
{
    for (size_t i = 0; i < NUM_SPI_BUSES; i++) {
        if (!configure_spi_bus(i, &spi_state[i], &spi_config[i])) {
            return false;
        }
    }

    last_hal_status = HAL_OK;

    return true;
}

void destroy()
{
}

bool select(address_t address, bool value)
{
    const spi_bus_config_t* pCfg;
    const gpio_port_and_pins_t* csPinCfg;

    if (is_spi_address_valid(address)) {
        pCfg = &spi_config[address.bus];
        csPinCfg = &pCfg->cs[address.device];
        HAL_GPIO_WritePin(csPinCfg->port, csPinCfg->pins, value ? GPIO_PIN_RESET : GPIO_PIN_SET);
        return true;
    } else {
        return false;
    }
}

bool setClockSpeed(std::uint8_t bus, std::uint32_t speed, std::uint32_t* result)
{
    uint32_t currentSpeed;
    uint32_t prescalers[] = {
        SPI_BAUDRATEPRESCALER_2,
        SPI_BAUDRATEPRESCALER_4,
        SPI_BAUDRATEPRESCALER_8,
        SPI_BAUDRATEPRESCALER_16,
        SPI_BAUDRATEPRESCALER_32,
        SPI_BAUDRATEPRESCALER_64,
        SPI_BAUDRATEPRESCALER_128,
        SPI_BAUDRATEPRESCALER_256,
    };
    bool success = false;
    unsigned int i;

