project-teller/obc/src/hal/stm32/spi.cpp
    if (!is_spi_bus_index_valid(bus)) {
        goto exit;
    }

    currentSpeed = getPeripheralClockFreqForBus(bus);

    /* We can choose a prescaler value that is a power of 2, up to 256.
     * Pick the one that produces the highest clock speed that is still lower
     * than the specified one */
    currentSpeed >>= 1;
    success = false;
    for (i = 0; i < sizeof(prescalers) / sizeof(prescalers[0]); i++) {
        if (currentSpeed <= speed) {
            /* This prescaler will be OK */
            success = true;
            break;
        }

        currentSpeed >>= 1;
    }

    if (success) {
#ifdef STM32F4
        spi_bus_state_t* state = &spi_state[bus];
        uint32_t regValue;

        regValue = state->handle.Instance->CR1;
        state->handle.Instance->CR1 = (regValue & ~SPI_CR1_BR_Msk) | (prescalers[i] & SPI_CR1_BR_Msk);
#else
        /* Not supported */
#endif
    }

exit:
    if (success && result) {
        *result = speed;
    }

    return success;
}

bool transfer(
    address_t address, std::uint8_t* buf, std::uint16_t size, std::uint8_t flags)
{
    return transfer(address, buf, buf, size, flags);
}

bool transfer(
    address_t address, std::uint8_t* txBuf, std::uint8_t* rxBuf, std::uint16_t size,
    std::uint8_t flags)
{
    const spi_bus_config_t* pCfg;
    const gpio_port_and_pins_t* csPinCfg;
    spi_bus_state_t* pState;
    bool success = false;
    std::uint32_t events;

    if (!is_spi_address_valid(address)) {
        return false;
    }

    if (txBuf == nullptr && rxBuf == nullptr) {
        return true;
    }

    pCfg = &spi_config[address.bus];
    csPinCfg = &pCfg->cs[address.device];

    pState = &spi_state[address.bus];

    if (pCfg->use_irq && osKernelGetState() == osKernelRunning) {
        // RTOS kernel is running so we can use event flags
        lock_guard lock(pState->in_use);

        if ((flags & NO_CHIP_SELECT) == 0) {
            HAL_GPIO_WritePin(csPinCfg->port, csPinCfg->pins, GPIO_PIN_RESET);
        }
        if (HAL_SPI_TransmitReceive_IT(&pState->handle, txBuf, rxBuf, size) == HAL_OK) {
            events = osEventFlagsWait(pState->event, EVT_DONE | EVT_ERROR, osFlagsWaitAny, SPI_TIMEOUT_MSEC);
            if (events & (osFlagsError | EVT_ERROR)) {
                HAL_SPI_Abort(&pState->handle);
            } else {
                success = events & EVT_DONE;
            }
        }
        if ((flags & NO_CHIP_SELECT) == 0) {
            HAL_GPIO_WritePin(csPinCfg->port, csPinCfg->pins, GPIO_PIN_SET);
        }
    } else {
        // Simplified implementation for the initialization where we cannot
        // use RTOS primitives yet, and for the SPI buses where we are not using
        // interrupts
        if ((flags & NO_CHIP_SELECT) == 0) {
            HAL_GPIO_WritePin(csPinCfg->port, csPinCfg->pins, GPIO_PIN_RESET);
        }
        if (HAL_SPI_TransmitReceive(&pState->handle, txBuf, rxBuf, size, SPI_TIMEOUT_MSEC) == HAL_OK) {
            success = true;
        }
        if ((flags & NO_CHIP_SELECT) == 0) {
            HAL_GPIO_WritePin(csPinCfg->port, csPinCfg->pins, GPIO_PIN_SET);
        }
    }

    return success;
}

bool transfer(
    address_t address, const transfer_t* transfers, std::uint16_t count,
    std::uint8_t flags)
{
    const transfer_t* transfer;
    const spi_bus_config_t* pCfg;
    const gpio_port_and_pins_t* csPinCfg;
    spi_bus_state_t* pState;
    HAL_StatusTypeDef hal_status;
    std::uint32_t events;
    bool success = false;

    if (!is_spi_address_valid(address)) {
        return false;
    }

    pCfg = &spi_config[address.bus];
    csPinCfg = &pCfg->cs[address.device];

    pState = &spi_state[address.bus];

    if (count == 0) {
        count = std::numeric_limits<std::uint16_t>::max();
    }

    hal_status = HAL_OK;
    if (pCfg->use_irq && osKernelGetState() == osKernelRunning) {
        // RTOS kernel is running so we can use event flags
        lock_guard lock(pState->in_use);

        if ((flags & NO_CHIP_SELECT) == 0) {
            HAL_GPIO_WritePin(csPinCfg->port, csPinCfg->pins, GPIO_PIN_RESET);
        }

        transfer = transfers;
        while (count > 0) {
            count--;

            if (transfer->tx_buf == nullptr && transfer->rx_buf == nullptr) {
                success = true;
                break;
            }

            hal_status = HAL_SPI_TransmitReceive_IT(
                &pState->handle,
                transfer->tx_buf ? transfer->tx_buf : transfer->rx_buf,
                transfer->rx_buf ? transfer->rx_buf : transfer->tx_buf,
                transfer->size);

            if (hal_status != HAL_OK) {
                break;
            }

            events = osEventFlagsWait(pState->event, EVT_DONE | EVT_ERROR, osFlagsWaitAny, SPI_TIMEOUT_MSEC);
            if (events & (osFlagsError | EVT_ERROR)) {
                HAL_SPI_Abort(&pState->handle);
                break;
            }

            transfer++;
        }

        if ((flags & NO_CHIP_SELECT) == 0) {
            HAL_GPIO_WritePin(csPinCfg->port, csPinCfg->pins, GPIO_PIN_SET);
        }
    } else {
        // Simplified implementation for the initialization where we cannot
        // use RTOS primitives yet, and for the SPI buses where we are not using
        // interrupts
        if ((flags & NO_CHIP_SELECT) == 0) {
            HAL_GPIO_WritePin(csPinCfg->port, csPinCfg->pins, GPIO_PIN_RESET);
        }

        transfer = transfers;
        while (count > 0) {
            count--;

            if (transfer->tx_buf != nullptr && transfer->rx_buf != nullptr) {
                hal_status = HAL_SPI_TransmitReceive(
                    &pState->handle, transfer->tx_buf, transfer->rx_buf,
                    transfer->size, SPI_TIMEOUT_MSEC);
            } else if (transfer->tx_buf != nullptr) {
                hal_status = HAL_SPI_Transmit(
                    &pState->handle, transfer->tx_buf, transfer->size, SPI_TIMEOUT_MSEC);
            } else if (transfer->rx_buf != nullptr) {
                hal_status = HAL_SPI_Receive(
                    &pState->handle, transfer->rx_buf, transfer->size, SPI_TIMEOUT_MSEC);
            } else {
                success = true;
                break;
            }

