project-teller/obc/src/hal/stm32/spi.cpp
            if (hal_status != HAL_OK) {
                break;
            }

            transfer++;
        }

        if ((flags & NO_CHIP_SELECT) == 0) {
            HAL_GPIO_WritePin(csPinCfg->port, csPinCfg->pins, GPIO_PIN_SET);
        }
    }

    last_hal_status = hal_status;

    return success;
}

bool unselect(address_t address)
{
    return select(address, false);
}

int getLastErrorCode(void)
{
    return static_cast<int>(last_hal_status);
}

}

/* ************************************************************************** */

static bool configure_spi_bus(
    std::uint8_t bus, spi_bus_state_t* state, const spi_bus_config_t* cfg)
{
    bool success = false;

    if (state->initialized || (state->cfg && state->cfg != cfg)) {
        return false;
    }

    state->cfg = cfg;

    if (cfg->instance == nullptr) {
        return true;
    }

    SPI_HandleTypeDef* pHandle = &state->handle;

    pHandle->Instance = cfg->instance;

    /* SPI peripheral clock speed is set in board.cpp, here we divide it by
     * the baud rate prescaler.
     *
     * On the TELLER OBC board, the peripheral clock runs at 84 MHz for SPI1 and
     * 42 MHz for SPI2 and SPI3.
     *
     * For SPI1:
     *
     * Prescaler = 2: SPI bus will run at 42 MHz
     * Prescaler = 128: SPI bus will run at 656.250 kHz
     * Prescaler = 256: SPI bus will run at 328.125 kHz
     *
     * For SPI2 and SPI3:
     *
     * Prescaler = 2: SPI bus will run at 21 MHz
     * Prescaler = 128: SPI bus will run at 328.125 kHz
     * Prescaler = 256: SPI bus will run at 164.0625 kHz
     *
     * Note that a low clock rate is required to communicate with SD cards
     * in order to bring them into SPI mode. Online sources suggest a clock
     * rate between 100 and 400 kHz, so we cannot bump the initial clock rate
     * of the SPI2 bus higher, but anyway it is safer to initialize the SPI
     * bus at the lowest clock speed and let the user bump it later if needed.
     */

    /* Comment on converting SPI modes to CLKPolarity and CLKPhase.
     *
     * In SPI mode 0 and mode 1, the clock idles low. So the LSB of the mode
     * number determines the phase, and the other bit determines the polarity.
     *
     * CLKPolarity is SPI CPOL; CPOL=0 means that the clock idles low, so
     * that belongs to SPI_POLARITY_LOW.
     *
     * CLKPhase means whether we are sampling on the first or the second edge.
     * This is SPI CPHA; CPHA=0 means that we are sampling on the first edge,
     * so that belongs to SPI_PHASE_1EDGE.
     */
    pHandle->Init.Mode = SPI_MODE_MASTER;
    pHandle->Init.Direction = SPI_DIRECTION_2LINES;
    pHandle->Init.DataSize = SPI_DATASIZE_8BIT;
    pHandle->Init.CLKPolarity = (cfg->mode & 0x02) ? SPI_POLARITY_HIGH : SPI_POLARITY_LOW;
    pHandle->Init.CLKPhase = (cfg->mode & 0x01) ? SPI_PHASE_2EDGE : SPI_PHASE_1EDGE;
    pHandle->Init.NSS = SPI_NSS_SOFT;
    pHandle->Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_256;
    pHandle->Init.FirstBit = SPI_FIRSTBIT_MSB;
    pHandle->Init.TIMode = SPI_TIMODE_DISABLE;
    pHandle->Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
    pHandle->Init.CRCPolynomial = 0x0;
#if defined(STM32H7)
    pHandle->Init.NSSPMode = SPI_NSS_PULSE_ENABLE;
    pHandle->Init.NSSPolarity = SPI_NSS_POLARITY_LOW;
    pHandle->Init.FifoThreshold = SPI_FIFO_THRESHOLD_01DATA;
    pHandle->Init.TxCRCInitializationPattern = SPI_CRC_INITIALIZATION_ALL_ZERO_PATTERN;
    pHandle->Init.RxCRCInitializationPattern = SPI_CRC_INITIALIZATION_ALL_ZERO_PATTERN;
    pHandle->Init.MasterSSIdleness = SPI_MASTER_SS_IDLENESS_00CYCLE;
    pHandle->Init.MasterInterDataIdleness = SPI_MASTER_INTERDATA_IDLENESS_00CYCLE;
    pHandle->Init.MasterReceiverAutoSusp = SPI_MASTER_RX_AUTOSUSP_DISABLE;
    pHandle->Init.MasterKeepIOState = SPI_MASTER_KEEP_IO_STATE_DISABLE;
    pHandle->Init.IOSwap = SPI_IO_SWAP_DISABLE;
#endif

    if (HAL_SPI_Init(pHandle) != HAL_OK) {
        goto cleanup;
    }

    /* HAL_SPI_MspInit sets state->initialized to true. If this is still false
     * at this point, it means that the initialization was not successful */
    if (!state->initialized) {
        goto cleanup;
    }

    state->event = osEventFlagsNew(nullptr);
    if (!state->event) {
        goto cleanup;
    }

    /* We can now set the clock speed if the clock speed is specified explicitly
     * for the bus */
    success = true;
    if (cfg->clock_speed > 0) {
        success &= teller::hal::spi::setClockSpeed(bus, cfg->clock_speed);
    }

cleanup:
    if (state->initialized && !success) {
        HAL_SPI_DeInit(pHandle);
        state->initialized = false;
    }

    return success;
}

/* Finds the SPI configuration corresponding to the given physical SPI bus handle */
static spi_bus_state_t* find_spi_bus_state(SPI_HandleTypeDef* hspi)
{
    for (int index = 0; index < NUM_SPI_BUSES; index++) {
        if (hspi == &spi_state[index].handle) {
            return &spi_state[index];
        }
    }

    return nullptr;
}

/* Returns whether an SPI address is valid */
static bool is_spi_address_valid(teller::hal::spi::address_t address)
{
    if (!is_spi_bus_index_valid(address.bus)) {
        return false;
    }

    if (address.device >= NUM_CS_PINS_PER_BUS || !spi_config[address.bus].cs[address.device].port) {
        return false;
    }

    return true;
}

/* Returns whether an SPI bus index is valid */
static bool is_spi_bus_index_valid(std::uint8_t bus)
{
    return bus < NUM_SPI_BUSES && spi_state[bus].initialized;
}

/* Helper function to return the peripheral clock frequency for the SPI bus
 * with the given index.
 *
 * On an STM32F4, SPI2 and SPI3 are on peripheral clock 1 while SPI1 is on
 * peripheral clock 2.
 */
static uint32_t getPeripheralClockFreqForBus(std::uint8_t bus)
{
    if (!is_spi_bus_index_valid(bus)) {
        return 0;
    }

    /* TODO(ntamas): update this for STM32H7 as well! */
#ifdef STM32F4
    if (spi_config[bus].instance == SPI1) {
        return HAL_RCC_GetPCLK2Freq();
    } else {
        return HAL_RCC_GetPCLK1Freq();
    }
#else
    return HAL_RCC_GetPCLK1Freq();
#endif
}

/* ************************************************************************** */

