project-teller/obc/src/hal/stm32/spi.cpp
extern "C" {

/* Weakly linked function that is called by the STM32 HAL when a physical SPI bus is
 * initialized
 */
void HAL_SPI_MspInit(SPI_HandleTypeDef* hspi)
{
    GPIO_InitTypeDef GPIO_InitStruct = { 0 };
    uint8_t gpioFunc = 0;

#ifdef STM32H7
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = { 0 };
    PeriphClkInitStruct.Spi123ClockSelection = RCC_SPI123CLKSOURCE_PLL;
#endif

    spi_bus_state_t* state = find_spi_bus_state(hspi);
    const spi_bus_config_t* cfg = state ? state->cfg : nullptr;
    if (!cfg) {
        return;
    }

    if (hspi->Instance == SPI1) {
        gpioFunc = GPIO_AF5_SPI1;

#ifdef STM32H7
        /* Initializes the peripherals clock */
        PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SPI1;
        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK) {
            return;
        }
#endif

        /* Peripheral clock enable */
        __HAL_RCC_SPI1_CLK_ENABLE();
    } else if (hspi->Instance == SPI2) {
        gpioFunc = GPIO_AF5_SPI2;

#ifdef STM32H7
        RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = { 0 };

        /* Initializes the peripherals clock */
        PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SPI2;
        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK) {
            return;
        }
#endif

        /* Peripheral clock enable */
        __HAL_RCC_SPI2_CLK_ENABLE();
    } else if (hspi->Instance == SPI3) {
        gpioFunc = GPIO_AF6_SPI3;

#ifdef STM32H7
        RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = { 0 };

        /* Initializes the peripherals clock */
        PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SPI3;
        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK) {
            return;
        }
#endif

        /* Peripheral clock enable */
        __HAL_RCC_SPI3_CLK_ENABLE();
    }

    /* GPIO configuration */
    for (int i = 0; i < NUM_GPIO_PINS_PER_BUS; i++) {
        if (cfg->gpio.by_index[i].port && cfg->gpio.by_index[i].pins) {
            enableGPIOClocksForPort(cfg->gpio.by_index[i].port);
            GPIO_InitStruct.Pin = cfg->gpio.by_index[i].pins;
            GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
            /* It seems like GPIO_PULLDOWN is needed for the SD card to work */
            GPIO_InitStruct.Pull = i > 0 ? GPIO_PULLDOWN : GPIO_NOPULL;
            GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
            GPIO_InitStruct.Alternate = gpioFunc;
            HAL_GPIO_Init(cfg->gpio.by_index[i].port, &GPIO_InitStruct);
        }
    }

    /* Chip select pin configuration */
    for (int i = 0; i < NUM_CS_PINS_PER_BUS; i++) {
        if (cfg->cs[i].port && cfg->cs[i].pins) {
            enableGPIOClocksForPort(cfg->cs[i].port);
            GPIO_InitStruct.Pin = cfg->cs[i].pins;
            GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
            GPIO_InitStruct.Pull = GPIO_NOPULL;
            GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
            HAL_GPIO_Init(cfg->cs[i].port, &GPIO_InitStruct);
            HAL_GPIO_WritePin(cfg->cs[i].port, cfg->cs[i].pins, GPIO_PIN_SET);
        }
    }

    /* IRQ configuration */
    if (cfg->irq) {
        /* Priority 5 is the highest (i.e. smallest numeric value) that is
         * allowed without interfering with FreeRTOS */
        HAL_NVIC_SetPriority(cfg->irq, 5, 0);
        HAL_NVIC_EnableIRQ(cfg->irq);
    }

    state->initialized = true;

    if (hspi->Instance == SPI1) {
        spi_handle_ptrs[1] = hspi;
    } else if (hspi->Instance == SPI2) {
        spi_handle_ptrs[2] = hspi;
    } else if (hspi->Instance == SPI3) {
        spi_handle_ptrs[3] = hspi;
    }
}

/* Weakly linked function that is called by the STM32 HAL when an SPI bus is
 * deinitialized
 */
void HAL_SPI_MspDeInit(SPI_HandleTypeDef* hspi)
{
    spi_bus_state_t* state = find_spi_bus_state(hspi);
    const spi_bus_config_t* cfg = state ? state->cfg : nullptr;
    if (!cfg) {
        return;
    }

    if (hspi->Instance == SPI1) {
        __HAL_RCC_SPI1_CLK_DISABLE();
    } else if (hspi->Instance == SPI2) {
        __HAL_RCC_SPI2_CLK_DISABLE();
    } else if (hspi->Instance == SPI3) {
        __HAL_RCC_SPI3_CLK_DISABLE();
    }

    for (int i = NUM_GPIO_PINS_PER_BUS - 1; i >= 0; i--) {
        if (cfg->gpio.by_index[i].port && cfg->gpio.by_index[i].pins) {
            HAL_GPIO_DeInit(cfg->gpio.by_index[i].port, cfg->gpio.by_index[i].pins);
        }
    }

    for (int i = NUM_CS_PINS_PER_BUS - 1; i >= 0; i--) {
        if (cfg->cs[i].port && cfg->cs[i].pins) {
            HAL_GPIO_DeInit(cfg->cs[i].port, cfg->cs[i].pins);
        }
    }

    if (cfg->irq) {
        HAL_NVIC_DisableIRQ(cfg->irq);
    }

    if (state) {
        osEventFlagsDelete(state->event);
        state->initialized = false;
    }

    if (hspi->Instance == SPI1) {
        spi_handle_ptrs[1] = nullptr;
    } else if (hspi->Instance == SPI2) {
        spi_handle_ptrs[2] = nullptr;
    } else if (hspi->Instance == SPI3) {
        spi_handle_ptrs[3] = nullptr;
    }
}

void SPI1_IRQHandler(void)
{
    SPI_HandleTypeDef* ptr = spi_handle_ptrs[1];
    if (ptr) {
        HAL_SPI_IRQHandler(ptr);
    }
}

void SPI2_IRQHandler(void)
{
    SPI_HandleTypeDef* ptr = spi_handle_ptrs[2];
    if (ptr) {
        HAL_SPI_IRQHandler(ptr);
    }
}

void SPI3_IRQHandler(void)
{
    SPI_HandleTypeDef* ptr = spi_handle_ptrs[3];
    if (ptr) {
        HAL_SPI_IRQHandler(ptr);
    }
}

void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef* spi)
{
    spi_bus_state_t* state = find_spi_bus_state(spi);
    if (state) {
        osEventFlagsSet(state->event, EVT_DONE);
    }
}

void HAL_SPI_ErrorCallback(SPI_HandleTypeDef* spi)
{
    spi_bus_state_t* state = find_spi_bus_state(spi);
    if (state) {
        osEventFlagsSet(state->event, EVT_ERROR);
    }
}
}
